/*Теоретичні питання
1. Опишіть своїми словами як працює метод forEach.
Цей метод потрібен для перебору кожного елементу масиву, для якого буде визиватись callback функція. Сам метод нічого не повертає.
2. Як очистити масив ?
Записати змінну, в яку вкладено масив у пусті квадратні дужки, або встановити length 0.
3. Як можна перевірити, що та чи інша змінна є масивом ?
Array.isArray([]) поверне true/false


Завдання
Реалізувати функцію фільтру масиву за вказаним типом даних.Завдання має бути виконане на чистому Javascript без використання бібліотек типу jQuery або React.

Технічні вимоги:
    Написати функцію filterBy(), яка прийматиме 2 аргументи.Перший аргумент - масив, який міститиме будь - які дані, другий аргумент - тип даних.
Функція повинна повернути новий масив, який міститиме всі дані, які були передані в аргумент, за винятком тих, тип яких був переданий другим аргументом.Тобто якщо передати масив['hello', 'world', 23, '23', null], і другим аргументом передати 'string', то функція поверне масив[23, null].
*/

let array = ['hello', 'world', 23, '23', null];

let typeOfDate = 'string';

const filterBy = (array, type) => {
    let result = array.filter(value => {
        return typeof value !== type
    })
    return result
}

const result = filterBy(array, typeOfDate);

console.log(result);