/*Теоретичні питання

1. Опишіть, як можна створити новий HTML тег на сторінці.
document.createElement("назва елементу")

2. Опишіть, що означає перший параметр функції insertAdjacentHTML і опишіть можливі варіанти цього параметра.
цей параметр відповідає за розміщення новоствореного елементу.
beforebegin - перед батьківським тегом
afterend - після батьківського тегу
afterbegin - всередині батьківського тегу спочатку
beforeend - всередині батьківського тегу вкінці
3. Як можна видалити елемент зі сторінки?
за допомогою методу remove().

Завдання
Реалізувати функцію, яка отримуватиме масив елементів і виводити їх на сторінку у вигляді списку. Завдання має бути виконане на чистому Javascript без використання бібліотек типу jQuery або React.

Технічні вимоги:
Створити функцію, яка прийматиме на вхід масив і опціональний другий аргумент parent - DOM-елемент, до якого буде прикріплений список (по дефолту має бути document.body.
кожен із елементів масиву вивести на сторінку у вигляді пункту списку;

Приклади масивів, які можна виводити на екран:
["hello", "world", "Kiev", "Kharkiv", "Odessa", "Lviv"];
["1", "2", "3", "sea", "user", 23];
Можна взяти будь-який інший масив. */


const array = [
    "hello",
    "world",
    "Kiev",
    "Kharkiv",
    "Odessa",
    "Lviv",
    "1",
    "2",
    "4",
    "sea",
    "user",
    23,
];
const parent = document.body;

const list = (array, parent) => {
    const ul = document.createElement("ul");

    parent.append(ul);
    array.forEach((items) => {
        ul.insertAdjacentHTML("beforeend", `<li>${items}</li>`);
    });
};
list(array, parent);